

conclusion = {
    20: """Результаты пробного теста свидетельствуют о том, что ребенок столкнулся с серьезными трудностями в освоении материала по математике, логике, английскому, русскому и казахскому языкам. Его процент правильных ответов составил всего {}%, что поднимает вопросы о его готовности к вступительным экзаменам в Национальную школу высшего образования (НИШ).""",
    40: """Результаты пробного теста указывают на то, что ребенок продемонстрировал некоторый уровень готовности к вступительным экзаменам в Национальную школу высшего образования (НИШ), ответив правильно на {}% вопросов. Однако, есть потребность в дополнительной подготовке для улучшения успехов и достижения более высоких результатов.""",
    60: """Результаты пробного теста свидетельствуют о том, что ребенок проявил хороший уровень готовности к вступительным экзаменам в Национальную школу высшего образования (НИШ), ответив правильно на {}% вопросов. Он продемонстрировал заметный прогресс, но есть потребность в дополнительной работе для достижения еще более высоких результатов.""",
    80: """Результаты пробного теста свидетельствуют о том, что ребенок проявил высокий уровень готовности к вступительным экзаменам в Национальную школу высшего образования (НИШ). С общим процентом правильных ответов в {}%, он продемонстрировал качественные знания по математике, логике, английскому, русскому и казахскому языкам.""",
    100: """Результаты пробного теста говорят о том, что ребенок проявил выдающуюся готовность к вступительным экзаменам в Национальную школу высшего образования (НИШ). Он ответил правильно на {}% вопросов, что свидетельствует о высоком уровне подготовки в математике, логике, английском, русском и казахском языках."""
}

recomendation = {
    20: """Интенсивные занятия с репетиторами:
Ребенку требуется индивидуальный подход, предоставляемый опытными репетиторами по каждому из предметов. Это позволит выявить конкретные слабости и разработать стратегии для их преодоления.

Углубленное изучение предметов:
Особое внимание следует уделить математике, логике и языкам, так как они являются ключевыми компонентами вступительных экзаменов. Занятия должны быть систематическими, а изучение материала – углубленным.

Индивидуальные планы обучения:
Разработка индивидуальных планов обучения для каждого предмета поможет сосредоточиться на слабых сторонах ребенка, а также сбалансировать его образовательный процесс.

Практика в решении задач:
Занятия по решению задач и практика в применении знаний в реальных ситуациях помогут ребенку лучше усвоить материал и развить навыки применения полученных знаний.

Мотивация и поддержка:
Важно создать позитивное обучающее окружение, поддерживая мотивацию ребенка и помогая ему преодолевать трудности. Родители играют ключевую роль в моральной поддержке и стимулировании интереса к учебе.

Мониторинг прогресса:
Регулярный мониторинг успехов и корректировка плана обучения в соответствии с изменениями в прогрессе ребенка позволит поддерживать эффективность учебного процесса.

Дополнительные занятия, построенные на персонализированном подходе, смогут помочь ребенку подготовиться к вступительным экзаменам в Национальную школу высшего образования и повысить свой уровень подготовки в ключевых предметах.""",
40: """Индивидуализированные уроки с репетиторами:
Ребенку следует пройти индивидуальные занятия с опытными репетиторами по каждому предмету. Это позволит выявить конкретные слабости и разработать персональный план обучения.

Усиленное изучение материала:
Особое внимание нужно уделить предметам, где ребенок показал более низкие результаты. Интенсивные уроки по математике, логике, английскому, русскому и казахскому языкам помогут закрепить знания.

Развитие логического мышления:
Так как логика является частью теста, тренировки по развитию логического мышления, включая решение головоломок и задач, могут значительно улучшить успехи ребенка.

Практика на языках:
Поскольку английский, русский и казахский важны для успешного сдачи экзаменов, уделите внимание разнообразным методам изучения языков, включая чтение, письмо, аудирование и разговорную практику.

Тестовые упражнения и симуляции:
Проведение регулярных тестовых упражнений и симуляций вступительных экзаменов поможет ребенку привыкнуть к формату теста и улучшить управление временем.

Поддержка родителей:
Важно, чтобы родители поддерживали ребенка в учебе, следили за его прогрессом и создавали благоприятное обучающее окружение.

Регулярный мониторинг прогресса:
Постоянный контроль и коррекция учебного процесса в соответствии с изменениями в прогрессе ребенка обеспечат эффективное обучение.

Дополнительные занятия, нацеленные на усиленное изучение предметов и поддерживаемые индивидуализированным подходом, помогут ребенку улучшить свои шансы на успешное прохождение вступительных экзаменов в НИШ.""",
60: """Углубленная подготовка по математике:
Поскольку математика является важным компонентом экзаменов, рекомендуется углубленное изучение тем, где ребенок допустил ошибки. Дополнительные задачи и практические упражнения могут помочь закрепить знания.

Развитие логического мышления:
Видимо, что логика также играет важную роль. Практика в решении задач, головоломок и упражнений по логике помогут ребенку улучшить свои навыки.

Интенсивные занятия по языкам:
Чтобы улучшить результаты по английскому, русскому и казахскому языкам, рекомендуется проводить интенсивные занятия, включающие чтение, письмо, обсуждение текстов и практику разговорной речи.

Тестовые упражнения и симуляции:
Регулярная практика с использованием тестовых упражнений и симуляций экзаменов поможет ребенку привыкнуть к формату и условиям тестирования.

Поддержание высокого уровня мотивации:
Поддерживайте мотивацию ребенка, поощряйте его усилия и достижения. Мотивированный ученик более успешен в усвоении материала.

Регулярный мониторинг прогресса:
Важно вести постоянный мониторинг успехов и корректировать учебный план в соответствии с прогрессом ребенка.

Дополнительные углубленные занятия и фокус на слабых сторонах, а также поддержка в развитии языковых навыков, помогут ребенку максимально подготовиться к вступительным экзаменам и улучшить свои результаты.""",
80: """Консолидация знаний:
Ребенку следует регулярно повторять и закреплять усвоенный материал. Это поможет удержать высокий уровень подготовки к экзаменам.

Индивидуальные занятия:
Организация индивидуальных занятий с репетиторами может помочь устранить оставшиеся слабости и подготовиться к более сложным вопросам.

Тестовые симуляции:
Проведение тестовых симуляций с ограничением времени поможет ребенку привыкнуть к динамике вступительных экзаменов и улучшить умение управлять временем.

Углубленное изучение языков:
Поскольку языки играют важную роль, рекомендуется углубленное изучение английского, русского и казахского языков. Чтение литературы, практика письма и общение на этих языках помогут улучшить навыки.

Развитие логического мышления:
Продолжение развития логического мышления через головоломки, задачи и тематические упражнения поможет подготовить ребенка к сложным логическим вопросам.

Мониторинг прогресса:
Регулярный мониторинг успехов поможет выявлять любые изменения в уровне подготовки и адаптировать учебный план.

Сохранение мотивации:
Важно сохранять мотивацию ребенка, поощряя его усилия и успехи, чтобы поддерживать интерес к учебе.

Дополнительные занятия, углубленное изучение предметов и фокус на дополнительных тестовых симуляциях помогут ребенку максимально подготовиться к вступительным экзаменам в НИШ и повысить шансы на успешное поступление.""",
100: """
Систематическое повторение материала:
С учетом высоких результатов рекомендуется регулярно повторять усвоенный материал, чтобы поддерживать высокий уровень подготовки.

Индивидуальные уроки с репетиторами:
При наличии некоторых слабостей ребенку может быть полезно пройти индивидуальные уроки с репетиторами по тем предметам, где выявлены неоптимальные результаты.

Тестовые симуляции с ограничением времени:
Дополнительные тестовые симуляции с ограничением времени могут помочь ребенку привыкнуть к динамике вступительных экзаменов и улучшить навыки управления временем.

Развитие критического мышления и аналитических навыков:
Дополнительные задачи и упражнения, направленные на развитие критического мышления и аналитических навыков, могут пригодиться для более глубокого понимания предметов.

Практика языковых навыков:
Углубленное изучение английского, русского и казахского языков, включая чтение, письмо и разговорную практику, дополнит подготовку ребенка.

Мониторинг прогресса:
Регулярное отслеживание прогресса поможет выявлять любые изменения в уровне подготовки и адаптировать учебный план в соответствии с потребностями.

Поддержание мотивации:
Поддержание мотивации ребенка, подчеркивая его успешные результаты и поощряя к дальнейшим достижениям, сыграет важную роль в процессе обучения.

Ребенку рекомендуется активно использовать свой высокий уровень готовности, фокусируясь на систематическом повторении материала, дополнительных тестовых симуляциях и развитии аналитических навыков для максимальной успешности в вступительных экзаменах в НИШ."""
}

class_conclusion = {
    3: {
    20: """""",
    40: """""",
    60: """""",
    80: """""",
    100: """"""
    },
    4: {
    20: """""",
    40: """""",
    60: """""",
    80: """""",
    100: """"""
    },
    5: {
    20: """""",
    40: """""",
    60: """""",
    80: """""",
    100: """"""
    }
}

probability_without_preparation = {
    34: {
        34: {
            'NIS': 10,
            'RPMS': 5,
            'BIL': 15
        },
        67: {
            'NIS': 20,
            'RPMS': 10,
            'BIL': 25
        },
        100: {
            'NIS': 30,
            'RPMS': 15,
            'BIL': 35
        }
    },
    67: {
        34: {
            'NIS': 30,
            'RPMS': 20,
            'BIL': 35
        },
        67: { 
            'NIS': 40,
            'RPMS': 25,
            'BIL': 45
        },
        100: {
            'NIS': 50,
            'RPMS': 30,
            'BIL': 55
        }
    },
    100: {
        34: {
            'NIS': 50,
            'RPMS': 45,
            'BIL': 60
        },
        67: {
            'NIS': 60,
            'RPMS': 50,
            'BIL': 70
        } ,
        100: {
            'NIS': 70,
            'RPMS': 55,
            'BIL': 75
        }
    }

}

probability_with_preparation = {
    1: {
        'NIS': 99,
        'RPMS': 97,
        'BIL': 98
    },
    2: {
        'NIS': 98,
        'RPMS': 95,
        'BIL': 96
    },
    3: {
        'NIS': 96,
        'RPMS': 91,
        'BIL': 94
    },
    4: {
        'NIS': 85,
        'RPMS': 80,
        'BIL': 88
    },
    5: {
        'NIS': 81,
        'RPMS': 75,
        'BIL': 83
    },
    6: {
        'NIS': 75,
        'RPMS': 70,
        'BIL': 78
    },
    7: {
        'NIS': 70,
        'RPMS': 65,
        'BIL': 73
    },
    8: {
        'NIS': 65,
        'RPMS': 60,
        'BIL': 68
    },
    9: {
        'NIS': 60,
        'RPMS': 55,
        'BIL': 63
    },
    10: {
        'NIS': 55,
        'RPMS': 50,
        'BIL': 58
    },
    11: {
        'NIS': 50,
        'RPMS': 45,
        'BIL': 53
    }
}


remaining_month = {
    1: 60,
    2: 48,
    3: 36,
    4: 24,
    5: 12,
    6: 0,
    7:0,
    8:0,
    9:0,
    10:0,
    11:0,
}


exact_characterization = {
        34: """Учащийся испытывает значительные трудности в понимании основ точных наук, что указывает на необходимость дополнительной работы над усвоением школьной программы по математике и логике. Возможно, потребуется индивидуальный подход в обучении и поиск более эффективных методик для улучшения понимания предмета. Важно мотивировать и поддерживать интерес к изучению, используя разнообразные образовательные ресурсы.""",
        67: """Результаты учащегося находятся в среднем диапазоне, что свидетельствует о базовом понимании математики и логики, но также указывает на наличие пробелов в знаниях. Рекомендуется уделить внимание закреплению уже изученного материала и акцентировать усилия на практических заданиях для развития навыков решения задач. Возможно, потребуется дополнительное внимание к сложным темам для повышения уровня владения предметом.""",
        100: """Учащийся демонстрирует хорошее владение материалом по точным наукам и успешно справляется с задачами повышенной сложности. Такой результат говорит о глубоком понимании математики и логики, а также о способности применять полученные знания в практических ситуациях. Важно продолжать поддерживать и развивать интерес к точным наукам, предоставляя возможности для изучения более сложных и интересных задач."""
}

natural_characterization = {
        34: """Учащийся испытывает серьезные трудности в освоении гуманитарных наук, включая русский, казахский и английский языки. Это указывает на необходимость интенсивного обучения и применения дополнительных методов обучения, направленных на повышение языковой грамотности и развитие навыков понимания текста. Важно создать мотивирующую учебную среду и использовать индивидуальный подход, чтобы пробудить интерес к изучению языков и культур.""",
        67: """Результаты свидетельствуют о базовом уровне владения гуманитарными науками. Учащийся обладает средним уровнем знаний по русскому, казахскому и английскому языкам, однако видны пробелы в знаниях и навыках. Рекомендуется уделить внимание углублению понимания языковой системы, расширению словарного запаса и практике речевых навыков. Использование интерактивных методов обучения и погружение в языковую среду могут способствовать лучшему усвоению материала.""",
        100: """Учащийся демонстрирует высокий уровень владения гуманитарными науками. Знания русского, казахского и английского языков находятся на продвинутом уровне, что свидетельствует о глубоком понимании языковых структур и культурных особенностей. Такой результат является показателем способности к анализу, критическому мышлению и эффективному общению. Важно продолжать развивать эти навыки, исследуя более сложные и многоаспектные темы, для дальнейшего совершенствования и расширения горизонтов."""
}

summary_characterization = {
    34: {
        34: """Учащийся сталкивается с трудностями как в точных, так и в гуманитарных дисциплинах, что требует комплексного подхода к обучению и поиска специальных методик для преодоления образовательных препятствий.""",
        67: """Результаты показывают трудности в точных науках при одновременном среднем успехе в гуманитарных. Это говорит о предпочтении гуманитарного направления и необходимости поддержки в обучении точным наукам.""",
        100: """При затруднениях в точных науках учащийся показывает выдающиеся результаты в гуманитарных, что указывает на его склонность и интерес к гуманитарным дисциплинам и необходимость индивидуального подхода к изучению точных наук."""
    },
    67: {
        34: """Наблюдается умеренный успех в точных науках при затруднениях в гуманитарных. Это может указывать на склонность к аналитическому мышлению и необходимость интенсивной работы над развитием языковых навыков.""",
        67: """Учащийся демонстрирует средний уровень успеха в обеих областях, что свидетельствует о сбалансированности его навыков и возможности дальнейшего развития в обеих направлениях.""",
        100: """Средний успех в точных науках и высокие достижения в гуманитарных говорят о хорошем балансе между аналитическими и гуманитарными навыками, предоставляя широкие перспективы для дальнейшего образования."""
    },
    100: {
        34: """Учащийся демонстрирует отличные результаты в точных науках, но испытывает трудности в гуманитарных. Это подчеркивает его склонность к аналитической деятельности и потребность в усилении языковой подготовки.""",
        67: """Высокие достижения в точных науках сочетаются со средним успехом в гуманитарных. Это подчеркивает сильные аналитические способности и потенциал для развития гуманитарных навыков.""",
        100: """Отличные результаты в точных и выдающиеся в гуманитарных науках демонстрируют высокий уровень универсальности и готовность к успешному освоению широкого спектра дисциплин."""
    }
}
